app/controllers/photos_controller.rb

DELETE FROM "photos" WHERE "id" = 1713
---
  def destroy
    @photo.destroy

SELECT * FROM "records" WHERE ("records"."id" = 1713)
---
  def set_record
    @record = Record.find(params[:record_id])

SELECT * FROM "photos" WHERE ("photos".record_id = 1713)
---
  def set_photo
    @photo = Photo.find(params[:id])