app/controllers/prices_controller.rb

SELECT DISTINCT(artist) FROM "prices" WHERE (LOWER(artist) LIKE E'b%') ORDER BY artist ASC LIMIT 8
---
  def auto_complete_for_price_artist
    @prices = Price.find(:all,
        :select => 'DISTINCT(artist)',
        :conditions => [ 'LOWER(artist) LIKE ?', "%#{params[:price][:artist].downcase}%" ],
        :order => 'artist ASC',
        :limit => 8)

SELECT DISTINCT(label) FROM "prices" WHERE (LOWER(label) LIKE E'ca%') ORDER BY label ASC LIMIT 8
---
  def auto_complete_for_price_label
    @prices = Price.find(:all,
        :select => 'DISTINCT(label)',
        :conditions => [ 'LOWER(label) LIKE ?', "#{params[:price][:label].downcase}%" ],
        :order => 'label ASC',
        :limit => 8)

SELECT * FROM "prices" WHERE (LOWER(artist) LIKE E'%bea%' and LOWER(label) LIKE E'%%' and format LIKE E'%%' and LOWER(detail) LIKE E'%%') LIMIT 10
SELECT count("prices".id) AS count_id FROM "prices" WHERE (LOWER(artist) LIKE E'%bea%' and LOWER(label) LIKE E'%%' and format LIKE E'%%' and LOWER(detail) LIKE E'%%')
---
  def index
    if params[:price] and params[:id] = "" and params[:hidden][:created_by] == ""
      @prices = Price.find(:all, :conditions => ['LOWER(artist) LIKE ? and LOWER(label) LIKE ? and format LIKE ? and LOWER(detail) LIKE ?',
         "%#{params[:price][:artist].downcase unless nil}%", "%#{params[:price][:label].downcase unless nil}%", "%#{params[:type]}%", "%#{params[:detail].downcase unless nil}%"],
         :limit => "#{params[:num_of_result]}")
      @prices_raw = Price.count(:id, :conditions => ['LOWER(artist) LIKE ? and LOWER(label) LIKE ? and format LIKE ? and LOWER(detail) LIKE ?',
          "%#{params[:price][:artist].downcase unless nil}%", "%#{params[:price][:label].downcase unless nil}%", "%#{params[:type]}%", "%#{params[:detail].downcase unless nil}%"])

SELECT * FROM "prices" WHERE ("prices"."id" = 0)
---
  def show
    @price = Price.find(params[:id])