app/controllers/records_controller.rb

SELECT * FROM `prices` WHERE (`prices`.`id` = 193270)
---
  def show
    @record = base_scope.includes(:artist, :label, :genre, :record_format, :price, :discogs_release)
                        .with_attached_images
                        .with_attached_songs
                        .find(params[:id])

SELECT * FROM "songs" WHERE ("songs".record_id = 7187)
---
  def set_record_for_delete
    @record = base_scope.with_attached_images.with_attached_songs.find(params[:id])