app/controllers/records_controller.rb

  def index

    @search = Search.new

    @records = Record.scoped
    @records = @records.where(:user_id => current_user.id)

    #@records = @records.where(:label_id => params[:label_id]) unless params[:label_id].blank?
    @records = @records.joins(:songs) if params[:mp3]
    @records = @records.where((params[:searchable_type].downcase+"_id").to_sym => params[:searchable_id]) unless params[:searchable_id].blank?

    @myvalue = @records.sum(:value)
    @records = @records.order("updated_at DESC").paginate :per_page => params[:per_page], :page => params[:page]
---
SELECT sum("records".value) AS sum_value FROM "records" left outer join prices on prices.id = records.price_id WHERE (artist like E'%%' and username = E'greggie')
SELECT * FROM "records"
SELECT "records".* FROM "records" INNER JOIN "prices" ON "prices".id = "records".price_id WHERE (prices.artist like E'%beatles%' and user = E'greggie') ORDER BY updated_at DESC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "records" INNER JOIN "prices" ON "prices".id = "records".price_id WHERE (LOWER(artist) like E'%%' and username = E'greggie')

  def show
    @record = Record.find(params[:id])
---
SELECT * FROM `records` WHERE (`records`.`id` = 7071)

  def new
    @record = Record.new

    if params[:id]
      @price = Price.find(params[:id])
---
SELECT * FROM "prices" WHERE ("prices"."id" = 11235)

  def edit
    @record = Record.find(params[:id])
---
SELECT * FROM `records` WHERE (`records`.`id` = 7071)

  def create
    @record = Record.new(params[:record])

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("comment", "created_at", "quantity", "updated_at", "username", "condition", "value", "genre", "price_id") VALUES(E'', '2009-12-11 13:21:06.234992', 1, '2009-12-11 13:21:06.234992', E'holden', 3, 125, 8, 11235) RETURNING "id"

  def update
    @record = Record.find(params[:id])
---
SELECT * FROM "records" WHERE ("records"."id" = 7176)

  def destroy
    @record = Record.find(params[:id])
    @record.destroy
---
SELECT * FROM "records" WHERE ("records"."id" = 7178)
DELETE FROM "records" WHERE "id" = 7178