app/controllers/searches_controller.rb

  def show
    @search = Search.find(params[:id])
---
SELECT * FROM "searches" WHERE ("searches"."id" = 29)

  def create
    @search = Search.new(params[:search])

    respond_to do |format|
      if @search.save
---
INSERT INTO "searches" ("artist", "label", "maximum_value", "format", "created_at", "title", "minimum_value", "updated_at", "condition", "user_id", "page", "genre") VALUES(E'beatles', E'', NULL, E'', '2009-12-11 13:39:43.220181', E'', NULL, '2009-12-11 13:39:43.220181', NULL, NULL, NULL, NULL) RETURNING "id"