app/controllers/songs_controller.rb

SELECT * FROM "songs" WHERE ("songs"."id" = 3)
DELETE FROM "songs" WHERE "id" = 3
---
  def destroy
    @song = Song.find(params[:id])
    @song.destroy